Revit 2026 API

# DisplacementElementGetAbsoluteDisplacement Method

---

The absolute displacement applied to the displaced elements.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetAbsoluteDisplacement()
```
```vb
Public Function GetAbsoluteDisplacement As XYZ
```
```cpp
public:
XYZ^ GetAbsoluteDisplacement()
```
```fsharp
member GetAbsoluteDisplacement : unit -> XYZ
```

#### Return Value

XYZ The absolute displacement.

The value is the relative translation of this DisplacementElement plus the relative displacements of all of its ancestor DisplacementElements.

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace